Вам необходимо написать код для валидации данных пользователей, который будет проверять:

    Имя и фамилия:
        Длина от 1 до 25 символов
        Первая буква заглавная
        Остальные буквы в нижнем регистре
    Номер телефона:
        Начинается с +7
        Содержит 10 цифр

Формат входных данных:

    В первой строке - целое число T (0 < T < 10^5) - количество тестов.
    Далее в 3 * T строках - тройки: имя, фамилия и номер телефона (каждый на своей строке).
    Любая из строк не превышает 10^5 символов.

Формат выходных данных:

    Для каждого теста в отдельной строке:
        "yes", если данные валидны
        "no", если данные не валидны

Вам дана часть кода:
def validate(name, surname, phone):
    return ''
 
test_count = int(input())
for i in range(test_count):
    name = input()
    surname = input()
    phone = input()
    print(validate(name, surname, phone)) 
