Задача:

Написать модуль для работы с корзиной пользователя в онлайн-магазине продуктов.

Описание:

    Товары в магазине имеют ограниченное количество.
    Модуль должен поддерживать добавление и удаление продуктов из корзины пользователя.

Формат входных данных:

    Первая строка: N (1 ≤ N ≤ 10^3) - общее количество товаров в магазине.
    Следующие N строк: пары значений (a, b), где a - название товара (длина не более 100 символов, названия товаров всегда уникальные), b - количество товаров.
    Следующая строка: T (1 ≤ T ≤ 10^4) - количество действий пользователя.
    Следующие T строк: пары значений (x, y), где x принимает два значения: "+" (добавление товара) или "-" (удаление товара), y - название товара.

Формат выходных данных:

    Для каждого товара, который находится в корзине, вывести на отдельной строке пару значений (a, b), где a - название товара, b - количество товара в корзине.
    Товары должны быть отсортированы по алфавиту.

Вам дана часть кода:
def solve(n, products, t, actions):
    return ''

n = int(input())
products = []

for i in range(n):
    products.append(list(input().split()))
    
t = int(input())
actions = []

for i in range(t):
    actions.append(list(input().split())) 

print(solve(n, products, t, actions))
